/**
  ******************************************************************************
    * @File:		interface.h
	* @Author:	    陈宣良
	* @Date:		2017-05-19
	* @Brief:		用户界面头文件
  ******************************************************************************
  */
#ifndef __INTERFACE_H
#define __INTERFACE_H

/* Includes ------------------------------------------------------------------*/

/* 宏定义 --------------------------------------------------------------------*/

/* 变量及类型定义 -------------------------------------------------------------*/

/* 函数声明 -------------------------------------------------------------------*/
int administrator_interface(char *identity);
int student_interface(char *identity);
int teacher_interface(char *identity);
int counselor_interface(char *identity);

#endif // __INTERFACE_H

/**********************************END OF FILE***********************************/
