/**
  ******************************************************************************
    * @File:		main.c
    * @Author:	    陈宣良
	* @Date:		2017-05-19
	* @Brief:		程序初始化源文件
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include"db_operation.h"
#include"mark.h"
#include"teaching_task.h"
#include<stdio.h>
#include<string.h>
#include"administrator.h"
#include"login.h"
#include<stdlib.h>
#include<io.h>
#include<windows.h>

/* 宏定义 --------------------------------------------------------------------*/

/* 变量及类型定义 -------------------------------------------------------------*/

/* 函数声明 -------------------------------------------------------------------*/
static int system_init(void);
static int basic_interface(void);

/* 函数定义 -------------------------------------------------------------------*/

/*******************************************************************************
  * @函数名称		main
  * @函数说明		主函数
  * @输入参数       void
  * @返回参数       0(程序结束)
  *****************************************************************************/
int main(void){
    system_init();
    basic_interface();
	return 0;
}

/*******************************************************************************
  * @函数名称		system_init
  * @函数说明		系统初始化,创建管理员用户
  * @输入参数       void
  * @返回参数       0(初始化完成)
  *****************************************************************************/
static int system_init(void){
    FILE *fp;
    struct user admin;
    if(access("data.dat",0)!=0){
        fp=fopen("data.dat","wb");
        strcpy(admin.id,"0");
        strcpy(admin.password,"0");
        admin.type=0;
        add_to_db(&admin);
        fclose(fp);
    }
    return 0;
}

/*******************************************************************************
  * @函数名称		basic_interface
  * @函数说明		初始界面
  * @输入参数       void
  * @返回参数       0(返回主函数,结束程序)
  *****************************************************************************/
static int basic_interface(void){
    int input;
       while(1){
        system("cls");
        system ("color 1F");
        printf("*您好，欢迎使用\n");
        printf("┅┅┅┅┅┅┅┅\n");
        printf("\n\n");
        printf("╒============================================================================╕");
        printf("│ \t\t           *  Calculus成绩管理系统  *                         │");
        printf("├┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┤");
        printf("│ *现在要干什么？                                                            │\n");
        printf("│                                                                            │\n");
        printf("│                                                                            │\n");
        printf("│\t\t\t      ┏━━━━━━━┓                              │\n");
        printf("│\t\t\t      ┃*按1开始登陆* ┃                              │\n");
        printf("│\t\t\t      ┗━━━━━━━┛                              │\n");
        printf("│                                                                            │\n");
        printf("│                                                                            │\n");
        printf("│\t\t\t      ┏━━━━━━━┓                              │\n");
        printf("│\t\t\t      ┃*按2退出系统* ┃                              │\n");
        printf("│\t\t\t      ┗━━━━━━━┛                              │\n");
        printf("│                                                                            │\n");
        printf("│                                                    * 按3查看开发人员名单 * │\n");
        printf("│                                                                            │\n");
        printf("│                                                      * 按4查看注意事项 *   │\n");
        printf("┗──────────────────────────────────────┛\n");
        printf(" * 请输入相应数字: ");
        while(scanf("%d",&input) == EOF);
        system("cls");
        switch(input){
            case 1:login();break;
            case 2:return 0;
            case 3:
            printf("*您好，欢迎使用\n");
            printf("┅┅┅┅┅┅┅┅\n");
            printf("\n\n");
            printf("╒============================================================================╕");
            printf("│ \t\t           *  Calculus成绩管理系统  *                         │");
            printf("├┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┤");
            system("pause");
        }
    }
}



